Revit 2026 API

# ElectricalSystemFrame Property

---

The Frame value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Frame { get; set; }
```
```vb
Public Property Frame As Double
	Get
	Set
```
```cpp
public:
property double Frame {
	double get ();
	void set (double value);
}
```
```fsharp
member Frame : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for frame is not a number -or- When setting this property: The given value for frame is not finite |
| ArgumentOutOfRangeException | When setting this property: The given value for frame must be non-negative. |
| InvalidOperationException | This property only available when System Type is Power and Circuit Type is NOT Space! |

This property is used to retrieve the Frame value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace